app/views/messages/index.html.erb

      <% if message.body %>
        <% user = User.find(message.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]