app/views/converstions/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <% if converstion.sender_id == current_user.id %>
          <% recipient = User.find(converstion.recipient_id) %>
        <%else%>
          <% recipient = User.find(converstion.sender_id) %>