app/controllers/converstions_controller.rb

SELECT "users".* FROM "users"
SELECT "converstions".* FROM "converstions"
---
  def index
    @users = User.all
    @converstions = Converstion.all

SELECT "converstions".* FROM "converstions" WHERE ((converstions.sender_id = '2' AND converstions.recipient_id = '1' )
SELECT 1 AS one FROM "converstions" WHERE "converstions"."sender_id" = ? AND "converstions"."recipient_id" = ? LIMIT ?  [["sender_id", 2], ["recipient_id", 1], ["LIMIT", 1]]
INSERT INTO "converstions" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 2], ["recipient_id", 1], ["created_at", "2020-07-20 15:38:14.339313"], ["updated_at", "2020-07-20 15:38:14.339313"]]
---
  def create
    if Converstion.between(params[:sender_id], params[:recipient_id]).present?
      @converstion = Converstion.between(params[:sender_id], params[:recipient_id]).first
    else
      @converstion = Converstion.create!(converstion_params)