app/controllers/messages_controller.rb

class MessagesController < ApplicationController

  before_action do
    @converstion = Converstion.find(params[:converstion_id])
---
SELECT "converstions".* FROM "converstions" WHERE "converstions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @message = @converstion.messages.new(message_params)
    if @message.save
---
INSERT INTO "messages" ("body", "converstion_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hi"], ["converstion_id", 1], ["user_id", 2], ["created_at", "2020-07-20 16:40:12.105103"], ["updated_at", "2020-07-20 16:40:12.105103"]]